"""
[1] 문제에 대한 설명 ? (자연어로 정리)
- (1) 목표
- (2) 룰
- (3) 입력 값
- (4) 출력 값
- (5) 예외 상황

[2] 자료구조 / 알고리즘의 선택

- (1) hash - 해쉬 - 빠르게 찾아야 해?
- (2) Stack / Queue - 스택/큐 - 순서대로 처리해야해 ?
- (3) Heap - 힙 - 최댓값, 최소값
- (4) Sorting - 정렬 - 정렬이 필요한가 ?
- (5) Brute Force Search - 완전 탐색 - 모든 경우를 다 봐야 하는가?
- (6) Greedy Algorithm - 탐욕법 - 매번 최선의 선택인지 파악해야 하는가?
- (7) Dynamic Programming (DP) - 동적 프로그래밍 - 어떤 결과를 저장해서 써야 하는가?
- (8) Graph / DFS- BFS - 그래프 - 연결된 요소들을 어떻게 탐색 해야 하는가 ?
- (9) Binary Search - 이분 탐색 - 정렬된 리스트에서 빠르게 찾아야 하나 ?

[3] 흐름 설계
- (1)
- (2)
- (3)
- (4)
- (5)
- (6)
- (7)
- (8)
- (9)
- (10)
"""

